# 给出治疗方案

# 输入病症

# 给出临床表现、治疗方案、饮食禁忌

from .vtcheck import *
from .cmp_item import dcode_to_dname

def dcode_to_dname(code):
    dict = {'110000':'真性红细胞增多症',
            '120000':'肺原性心脏病',
            '130000':'症状：轻者感头昏，注意力不集中，记忆力差；重者可出现嗜睡或昏迷。为代偿贫血时机体组织器官供氧量的不足，心脏增加跳动次数及搏出量，可引起心慌、胸闷、气短。胃肠道细胞缺氧可引起食欲减低、腹胀及腹泻；'
                     '诊疗方向：补充叶酸和维生素Bl2叶酸、维生素B12摄人不足或吸收不良会导致巨幼细胞性贫血。叶酸缺乏者可口服叶酸10mg，每日3次，或30mg，每日1次肌注，直至贫血及症状完全消失，维生素B12缺乏者，每日1次肌注维生素B12，2周后，每周2次，血象正常后每月1次，痊愈后停药;'
                    '饮食禁忌：限制脂肪（每日脂肪供给量不应多于70克，一般以50克左右为宜。且应尽量选择含不饱和脂肪酸的植物油）、忌碱性食物（如馒头、高粱面等）、忌油炸食物和不易消化之物、忌饮茶和咖啡、忌大蒜、少喝牛奶;',
            '131100': '溶血性贫血',
            '131111':'获得性溶血性贫血',
            '131112':'全身性溶血性贫血',
            '131200':'出血性贫血',
            '131300':'细胞低色素贫血',
            '131400':'缺铁性贫血',
            '131500':'再生障碍性贫血',
            '131600':'镰刀细胞性贫血',
            '131700':'营养不良性巨幼红细胞性贫血',
            '140000':'均一性贫血',
            '141100':'小细胞均一性贫血',
            '141200':'小细胞非均一性贫血',
            '141300':'正常细胞非均一性贫血',
            '141400':'大细胞均一性贫血',
            '141500':'大细胞非均一性贫血',
            '141600':'正常细胞均一性贫血',
            '150000':'血小板增多症',
            '151100':'原发性血小板增多症',
            '151200':'症状性血小板增多症',
            '160000':'甲状腺功能低下',
            '170000':'白血病 ',
            '171100':'慢性白血病',
            '171200':'粒细胞白血病',
            '171300':'单核细胞白血病',
            '171400':'淋巴细胞性白血病',
            '171500':'慢性粒细胞白血病',
            '180000':'骨髓纤维化',
            '190000':'感染',
            '191100':'急性化脓感染',
            '191200':'病毒感染',
            '191300':'炎性感染',
            '210000':'炎症',
            '220000':'原发性血小板减少性紫癜',
            '250000':'播散性红斑狼疮',
            '260000':'骨髓造血机能障碍',
            '270000':'药物引起的骨髓抑制',
            '280000':'脾功能亢进',
            '290000':'血栓性疾病及血栓前状态',
            '310000':'慢粒',
            '320000':'巨大血小板综合症',
            '330000':'尿毒症',
            '340000':'酸中毒',
            '350000':'急性汞中毒',
            '360000':'急性铅中毒',
            '370000':'伤寒',
            '371100':'副伤寒',
            '380000':'疟疾',
            '390000':'流感',
            '410000':'寄生虫病',
            '430000':'何杰金病',
            '440000':'淋巴瘤',
            '450000':'骨髓增生异常综合征',
            '460000':'细胞增多症',
            '461100':'传染性单核细胞增多症',
            '461200':'急性传染性淋巴细胞增多症',
            '470000':'粒细胞缺乏症',
            '480000':'营养不良性巨幼红细胞性贫血',
            }
    return dict[code]

